---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralConnectionCodeCheckingStatus
source: html/dfcc628c-14d6-e951-26e7-11de99b20f42.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionCodeCheckingStatus

An enumerated type listing all code checking status of the structural connection element.

## Syntax (C#)
```csharp
public enum StructuralConnectionCodeCheckingStatus
```